PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_sd_host.h
#include "cy_device.h"

#if defined (CY_IP_MXSDHC)

#include <stdbool.h>
#include <stddef.h>
#include "cy_syslib.h"
#include "cy_syspm.h"

#if defined (__CC_ARM)
    #pragma anon_unions
#endif

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/**
* \addtogroup group_sd_host_macros_general_purpose
* \{
*/

/** Driver major version */
#define CY_SD_HOST_DRV_VERSION_MAJOR       2

/** Driver minor version */
#define CY_SD_HOST_DRV_VERSION_MINOR       40

/******************************************************************************
* API Constants
******************************************************************************/

#define CY_SD_HOST_ID                       CY_PDL_DRV_ID(0x3AU) /**< SD_HOST PDL ID */

#define CY_SD_HOST_BLOCK_SIZE               (512UL) /**< The SD memory card block size. */

#define CY_SD_HOST_SDSC_ADDR_SHIFT          (9U)    /**< This constant is used to get the
                                                      * address for the SDSC card using the
                                                      * shift operation instead of multiply to 512.
                                                      */

/* SD output clock. */
#define CY_SD_HOST_CLK_25M                  (25UL * 1000UL * 1000UL) /**< Clk = 25 MHz. */
#define CY_SD_HOST_CLK_50M                  (50UL * 1000UL * 1000UL) /**< Clk = 50 MHz. */
#define CY_SD_HOST_CLK_100M                 (100UL * 1000UL * 1000UL) /**< Clk = 100 MHz. */

#define CY_SD_HOST_CLK_RAMP_UP_TIME_MS      (100UL)  /**< The host power ramp up time. */

#ifndef CY_SD_HOST_CLK_RAMP_UP_TIME_US_WAKEUP  /* Define of the CY_SD_HOST_CLK_RAMP_UP_TIME_US_WAKEUP
                                                * suppresses CY_SD_HOST_CLK_RAMP_UP_TIME_MS_WAKEUP
                                                */
#ifndef CY_SD_HOST_CLK_RAMP_UP_TIME_MS_WAKEUP   /*
                                                 * This is legacy constant.
                                                 * It is left here just for backward compatibility.
                                                 * Do not use it in new designs.
                                                 */
#define CY_SD_HOST_CLK_RAMP_UP_TIME_US_WAKEUP (1U) /**< The default host power ramp up time during wake up from deep sleep. */
#else
#define CY_SD_HOST_CLK_RAMP_UP_TIME_US_WAKEUP (CY_SD_HOST_CLK_RAMP_UP_TIME_MS_WAKEUP * 1000U)
#endif /* !defined CY_SD_HOST_CLK_RAMP_UP_TIME_MS_WAKEUP */
#endif /* !defined CY_SD_HOST_CLK_RAMP_UP_TIME_US_WAKEUP */

/* ADMA constants. */
#define CY_SD_HOST_ADMA_NOP                 (0x0UL) /**< Does not execute the current line and go to next line. */
#define CY_SD_HOST_ADMA_RSV                 (0x2UL) /**< Reserved. */
#define CY_SD_HOST_ADMA_TRAN                (0x4UL) /**< Transfers data of one descriptor line. */
#define CY_SD_HOST_ADMA_LINK                (0x6UL) /**< The link to another descriptor. */
#define CY_SD_HOST_ADMA3_CMD                (0x1UL) /**< The Command descriptor. */
#define CY_SD_HOST_ADMA3_INTERGRATED        (0x7UL) /**< The Integrated descriptor. */
#define CY_SD_HOST_ADMA2_DESCR_SIZE         (0x2UL) /**< The ADMA2 descriptor size. */

/* ADMA descriptor table positions. */
#define CY_SD_HOST_ADMA_ATTR_VALID_POS      (0U) /**< The ADMA Attr Valid position. */
#define CY_SD_HOST_ADMA_ATTR_END_POS        (1U) /**< The ADMA Attr End position. */
#define CY_SD_HOST_ADMA_ATTR_INT_POS        (2U) /**< The ADMA Attr Int position. */
#define CY_SD_HOST_ADMA_ACT_POS             (3U) /**< The ADMA Act position. */
#define CY_SD_HOST_ADMA_RESERVED2_POS       (6U) /**< The ADMA Reserved2 position. */
#define CY_SD_HOST_ADMA_LEN_POS             (16U) /**< The ADMA Len position. */

/** \cond INTERNAL_MACROS */

#define CY_SD_HOST_EMMC_T_RSTW_US           (1U)
#define CY_SD_HOST_EMMC_T_RSCA_US           (200U)
#define CY_SD_HOST_INIT_CLK_FREQUENCY_KHZ   (400U)  /* The CLK frequency in kHz during card initialization. */
#define CY_SD_HOST_3_PERIODS_US             (((1000U * 3U) / CY_SD_HOST_INIT_CLK_FREQUENCY_KHZ) + 1U)

/** \endcond */

/** \} group_sd_host_macros_general_purpose */

/**
* \addtogroup group_sd_host_macros_card_states
* \{
*/

#define CY_SD_HOST_CARD_IDLE                (0x0UL)  /**< The card idle state. */
#define CY_SD_HOST_CARD_READY               (0x1UL)  /**< The card ready state. */
#define CY_SD_HOST_CARD_IDENT               (0x2UL)  /**< The card identification state. */
#define CY_SD_HOST_CARD_STBY                (0x3UL)  /**< The card stand-by state. */
#define CY_SD_HOST_CARD_TRAN                (0x4UL)  /**< The card transition state. */
#define CY_SD_HOST_CARD_DATA                (0x5UL)  /**< The card sending-data state. */
#define CY_SD_HOST_CARD_RCV                 (0x6UL)  /**< The card receive-data state. */
#define CY_SD_HOST_CARD_PRG                 (0x7UL)  /**< The card programming state. */
#define CY_SD_HOST_CARD_DIS                 (0x8UL)  /**< The card disconnect state. */

/** \} group_sd_host_macros_card_states */

/**
* \addtogroup group_sd_host_macros_card_status
* \{
*/

#define CY_SD_HOST_CMD13_OUT_OF_RANGE       (31U) /**< The command's argument is out of range. */
#define CY_SD_HOST_CMD13_ADDRESS_ERROR      (30U) /**< The address does not match the block length. */
#define CY_SD_HOST_CMD13_BLOCK_LEN_ERROR    (29U) /**< The block length is not allowed for this card. */
#define CY_SD_HOST_CMD13_ERASE_SEQ_ERROR    (28U) /**< An error in the sequence of erase commands occurred. */
#define CY_SD_HOST_CMD13_ERASE_PARAM        (27U) /**< An invalid selection of write blocks for erase occurred. */
#define CY_SD_HOST_CMD13_WP_VIOLATION       (26U) /**< The host attempts to write to a protected block
                                                    * or to the permanent write-protected card.
                                                    */
#define CY_SD_HOST_CMD13_CARD_IS_LOCKED     (25U) /**< The card is locked by the host. */
#define CY_SD_HOST_CMD13_LOCK_ULOCK_FAILED  (24U) /**< A sequence or password error occurred
                                                    * has been detected in the lock/unlock card command.
                                                    */
#define CY_SD_HOST_CMD13_COM_CRC_ERROR      (23U) /**< The CRC of the previous command failed. */
#define CY_SD_HOST_CMD13_ILLEGAL_COMMAND    (22U) /**< The command is not legal for the card state. */
#define CY_SD_HOST_CMD13_CARD_ECC_FAILED    (21U) /**< The card internal ECC failed. */
#define CY_SD_HOST_CMD13_CC_ERROR           (20U) /**< An internal card-controller error. */
#define CY_SD_HOST_CMD13_ERROR              (19U) /**< A general or unknown error occurred. */
#define CY_SD_HOST_CMD13_CSD_OVERWRITE      (16U) /**< Can be either one of the following
                                                    * errors:
                                                    * - The read only section of the CSD
                                                    * does not match the card content.
                                                    * - An attempt to reverse the copy (set
                                                    * as original) or permanent WP
                                                    * (unprotected) bits was made.
                                                    */
#define CY_SD_HOST_CMD13_WP_ERASE_SKIP      (15U) /**< Set when only partial address space
                                                    * was erased due to existing write protected blocks
                                                    * or a temporary or permanent write protected
                                                    * card was erased.
                                                    */
#define CY_SD_HOST_CMD13_CARD_ECC_DISABLED  (14U) /**< The command has been executed
                                                    * without using the internal ECC.
                                                    */
#define CY_SD_HOST_CMD13_CURRENT_STATE      (9U)  /**< The state of the card. */
#define CY_SD_HOST_CMD13_READY_FOR_DATA     (8U)  /**< The buffer is empty on the bus. */
#define CY_SD_HOST_CMD13_APP_CMD            (5U)  /**< The card will expect ACMD, or an
                                                    * indication that the command has
                                                    * been interpreted as ACMD.
                                                    */
#define CY_SD_HOST_CMD13_AKE_SEQ_ERROR      (3U)  /**< Error in the sequence of the
                                                    * authentication process.
                                                    */

#define CY_SD_HOST_CMD13_CURRENT_STATE_MSK  (0x00001E00UL) /**< The current state mask of the card. */

/** \} group_sd_host_macros_card_status */

/**
* \addtogroup group_sd_host_macros_scr
* \{
*/

#define CY_SD_HOST_SCR_SCR_STRUCTURE        (0x000000F0UL)  /**< Version number of the related SCR structure
                                                              * in the SD Memory Card Physical Layer Specification.
                                                              */

#define CY_SD_HOST_SCR_SD_SPEC              (0x0000000FUL)  /**< Describes the SD Memory Card Physical Layer
                                                              * Specification version supported by this card.
                                                              */

