PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_sd_host.h
/** SD Host auto command enable selection. */
typedef enum
{
    CY_SD_HOST_AUTO_CMD_NONE  = 0U,  /**< Auto command disable. */
    CY_SD_HOST_AUTO_CMD_12    = 1U,  /**< Auto command 12 enable. */
    CY_SD_HOST_AUTO_CMD_23    = 2U,  /**< Auto command 23 enable. */
    CY_SD_HOST_AUTO_CMD_AUTO  = 3U   /**< Auto command Auto enable. */
} cy_en_sd_host_auto_cmd_t;

/** SD Host reset types. */
typedef enum
{
    CY_SD_HOST_RESET_DATALINE = 0U, /**< Reset the data circuit only. */
    CY_SD_HOST_RESET_CMD_LINE = 1U, /**< Reset the command circuit only. */
    CY_SD_HOST_RESET_ALL      = 2U  /**< Reset the whole SD Host controller. */
} cy_en_sd_host_reset_t;

/** SD Host error interrupt types. */
typedef enum
{
    CY_SD_HOST_ADMA_ST_STOP   = 0U,   /**< Stop DMA - The SYS_ADR register points to
                                        * a location next to the error descriptor.
                                        */
    CY_SD_HOST_ADMA_ST_FDS    = 1U,   /**< Fetch Descriptor - The SYS_ADR register
                                        * points to the error descriptor.
                                        */
    CY_SD_HOST_ADMA_ST_TFR    = 3U,   /**< Transfer Data - SYS_ADR register points
                                        * to a location next to the error descriptor.
                                        */
    CY_SD_HOST_ADMA_LEN_ERR   = 4U   /**< The ADMA Length Mismatch error. */
} cy_en_sd_host_adma_error_t;

/** Auto CMD Status error codes. */
typedef enum
{
    CY_SD_HOST_AUTO_CMD12_NOT_EXEC         = 0U,  /**< Auto CMD12 Not Executed. */
    CY_SD_HOST_AUTO_CMD_TOUT_ERR           = 1U,  /**< Auto CMD Timeout Error. */
    CY_SD_HOST_AUTO_CMD_CRC_ERR            = 2U,  /**< Auto CMD CRC Error. */
    CY_SD_HOST_AUTO_CMD_EBIT_ERR           = 3U,  /**< Auto CMD End Bit Error. */
    CY_SD_HOST_AUTO_CMD_IDX_ERR            = 4U,  /**< Auto CMD Index Error. */
    CY_SD_HOST_AUTO_CMD_RESP_ERR           = 5U,  /**< Auto CMD Response Error. */
    CY_SD_HOST_CMD_NOT_ISSUED_AUTO_CMD12   = 7U   /**< Command Not Issued By Auto CMD12 Error. */
} cy_en_sd_host_auto_cmd_status_t;

/** SD host error codes. */
typedef enum
{
    CY_SD_HOST_SUCCESS                     = 0U,  /**< Successful. */
    CY_SD_HOST_ERROR                       = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 1U,  /**< Non-specific error code. */
    CY_SD_HOST_ERROR_INVALID_PARAMETER     = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 2U,  /**< The provided parameter is not valid. */
    CY_SD_HOST_ERROR_OPERATION_IN_PROGRESS = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 3U,  /**< A conflicting or requested operation is still in progress. */
    CY_SD_HOST_ERROR_UNINITIALIZED         = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 4U,  /**< The module (or part of it) was not initialized properly. */
    CY_SD_HOST_ERROR_TIMEOUT               = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 5U,  /**< A Time Out error occurred */
    CY_SD_HOST_OPERATION_INPROGRESS        = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 6U,  /**< The indicator for operation in progress. */
    CY_SD_HOST_ERROR_UNUSABLE_CARD         = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 7U,  /**< The card is unusable. */
    CY_SD_HOST_ERROR_DISCONNECTED          = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 8U   /**< The card is disconnected. */
} cy_en_sd_host_status_t;

/** The widths of the data bus. */
typedef enum
{
    CY_SD_HOST_BUS_WIDTH_1_BIT              = 0U,  /**< The 1-bit mode data transfer width. */
    CY_SD_HOST_BUS_WIDTH_4_BIT              = 1U,  /**< The 4-bit mode data transfer width. */
    CY_SD_HOST_BUS_WIDTH_8_BIT              = 2U  /**< The 8-bit mode data transfer width. */
} cy_en_sd_host_bus_width_t;

/** The bus speed modes. */
typedef enum
{
    CY_SD_HOST_BUS_SPEED_DEFAULT            = 0U,  /**< Default Speed mode: 3.3V signaling at 25 MHz SDClk. */
    CY_SD_HOST_BUS_SPEED_HIGHSPEED          = 1U,  /**< High Speed mode: 3.3V signaling at 50 MHz SDClk. */
    CY_SD_HOST_BUS_SPEED_SDR12_5            = 2U,  /**< SDR12: UHS-I (1.8V signaling) at 25 MHz SDClk (12.5 MB/sec). */
    CY_SD_HOST_BUS_SPEED_SDR25              = 3U,  /**< SDR25: UHS-I (1.8V signaling) at 50 MHz SDClk (25 MB/sec). */
    CY_SD_HOST_BUS_SPEED_SDR50              = 4U,  /**< SDR50: UHS-I (1.8V signaling) at 100 MHz SDClk (50 MB/sec). */
    CY_SD_HOST_BUS_SPEED_EMMC_LEGACY        = 5U,  /**< Backwards Compatibility with legacy MMC card (26MB/sec max). */
    CY_SD_HOST_BUS_SPEED_EMMC_HIGHSPEED_SDR = 6U,   /**< eMMC High speed SDR (52MB/sec max) */
    CY_SD_HOST_BUS_SPEED_DDR50              = 7U  /**< DDR50: UHS-I (1.8V signaling) at 50 MHz SDClk (50 MB/sec). */
} cy_en_sd_host_bus_speed_mode_t;

/** The SD bus voltage select. */
typedef enum
{
    CY_SD_HOST_IO_VOLT_3_3V                 = 0U,  /**< 3.3V.*/
    CY_SD_HOST_IO_VOLT_1_8V                 = 1U   /**< 1.8V. */
} cy_en_sd_host_io_voltage_t;

/** Erase type. */
typedef enum
{
    CY_SD_HOST_ERASE_ERASE               = 0U,  /**< The ERASE operation.*/
    CY_SD_HOST_ERASE_DISCARD             = 1U,  /**< The DISCARD operation. */
    CY_SD_HOST_ERASE_FULE                = 2U,  /**< The Full User Area Logical Erase (FULE) operation. */
    CY_SD_HOST_ERASE_SECURE              = 3U,  /**< The secure purge according to
                                                * Secure Removal Type in EXT_CSD
                                                * on the erase groups identified by the
                                                * startAddr&endAddr parameters and
                                                * any copies of those erase groups.
                                                */
    CY_SD_HOST_ERASE_SECURE_TRIM_STEP_2  = 4U,  /**< The secure purge operation on
                                                * the write blocks according to
                                                * Secure Removal Type in EXT_CSD
                                                * and copies of those write blocks
                                                * that were previously identified
                                                * using \ref Cy_SD_Host_Erase with
                                                * CY_SD_HOST_ERASE_SECURE_TRIM_STEP_1
                                                */
    CY_SD_HOST_ERASE_SECURE_TRIM_STEP_1  = 5U,  /**< Mark the write blocks, indicated
                                                * by the startAddr&endAddr parameters,
                                                * for secure erase.
                                                */
    CY_SD_HOST_ERASE_TRIM                = 6U   /**< Trim the write blocks identified by
                                                * the startAddr&endAddr parameters. The controller
                                                * can perform the actual erase at convenient time.
                                                */
} cy_en_sd_host_erase_type_t;

