PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_sd_host.h
/** Card type. */
typedef enum
{
    CY_SD_HOST_SD               = 0U,  /**< The Secure Digital card (SD). */
    CY_SD_HOST_SDIO             = 1U,  /**< The CD Input Output card (SDIO). */
    CY_SD_HOST_EMMC             = 2U,  /**< The Embedded Multimedia card (eMMC). */
    CY_SD_HOST_COMBO            = 3U,  /**< The Combo card (SD + SDIO). */
    CY_SD_HOST_UNUSABLE         = 4U,  /**< The unusable or not supported. */
    CY_SD_HOST_NOT_EMMC         = 5U   /**< The card is not eMMC. */
} cy_en_sd_host_card_type_t;

/** The card capacity type. */
typedef enum
{
    CY_SD_HOST_SDSC             = 0U,   /**< SDSC - Secure Digital Standard Capacity (up to 2 GB). */
    CY_SD_HOST_SDHC             = 1U,   /**< SDHC - Secure Digital High Capacity (up to 32 GB). */
    CY_SD_HOST_EMMC_LESS_2G     = 0U,   /**< The eMMC block addressing for less than 2GB. */
    CY_SD_HOST_EMMC_GREATER_2G  = 1U,   /**< The eMMC block addressing for greater than 2GB. */
    CY_SD_HOST_SDXC             = 2U,   /**< SDXC - Secure Digital Extended Capacity (up to 2 TB). */
    CY_SD_HOST_UNSUPPORTED      = 4U    /**< Not supported. */
} cy_en_sd_host_card_capacity_t;

/** SDHC response types. */
typedef enum
{
    CY_SD_HOST_RESPONSE_NONE    = 0U, /**< No Response. */
    CY_SD_HOST_RESPONSE_LEN_136 = 1U, /**< Response Length 136. */
    CY_SD_HOST_RESPONSE_LEN_48  = 2U, /**< Response Length 48. */
    CY_SD_HOST_RESPONSE_LEN_48B = 3U  /**< Response Length 48. Check Busy after response. */
} cy_en_sd_host_response_type_t;

/** The DMA type enum. */
typedef enum
{
    CY_SD_HOST_DMA_SDMA         = 0U, /**< SDMA mode. SDMA transfers a data boundary by a read/write command with max transfer size 512KB.*/
    CY_SD_HOST_DMA_ADMA2        = 2U, /**< ADMA2 mode. ADMA2 transfers multiple data boundaries by a read/write command with max transfer size 4GB.*/
    CY_SD_HOST_DMA_ADMA2_ADMA3  = 3U  /**< ADMA2-ADMA3 mode. ADMA3 performs multiple ADMA2 operations with max transfer size 4 EB.*/
} cy_en_sd_host_dma_type_t;

/** Write Protect type enum. */
typedef enum
{
    CY_SD_HOST_PERMANENT         = 0U, /**< The permanent write protect. */
    CY_SD_HOST_ENABLE_TEMPORARY  = 1U, /**< The temporary write protect. */
    CY_SD_HOST_DISABLE_TEMPORARY = 2U  /**< Clear the temporary write protect. */
} cy_en_sd_host_write_protect_t;

/** Card status in R1 response type enum. */
typedef enum
{
    CY_SD_HOST_AKE_SEQ_ERROR_R1_RESP         = 3U, /**< Error in the sequence of the authentication process. */
    CY_SD_HOST_APP_CMD_R1_RESP               = 5U, /**< The card will expect ACMD, or an indication that the command has been interpreted as ACMD. */
    CY_SD_HOST_FX_EVENT_R1_RESP              = 6U, /**< Extension Functions may set this bit to get host to deal with events. */
    CY_SD_HOST_READY_FOR_DATA_R1_RESP        = 8U, /**< Corresponds to buffer empty signaling on the bus. */
    CY_SD_HOST_CURRENT_STATE_0_R1_RESP       = 9U, /**< The state of the card when receiving the command. The four bits are interpreted as a binary coded number between 0 and 15. It is 0th bit. */
    CY_SD_HOST_CURRENT_STATE_1_R1_RESP       = 10U, /**< The state of the card when receiving the command. The four bits are interpreted as a binary coded number between 0 and 15. It is 1st bit. */
    CY_SD_HOST_CURRENT_STATE_2_R1_RESP       = 11U, /**< The state of the card when receiving the command. The four bits are interpreted as a binary coded number between 0 and 15. It is 2nd bit. */
    CY_SD_HOST_CURRENT_STATE_3_R1_RESP       = 12U, /**< The state of the card when receiving the command. The four bits are interpreted as a binary coded number between 0 and 15. It is 3rd bit. */
    CY_SD_HOST_ERASE_RESET_R1_RESP           = 13U, /**< It indicates if an erase sequence was cleared before executing because an out of erase sequence command was received. */
    CY_SD_HOST_CARD_ECC_DISABLED_R1_RESP     = 14U, /**< It indicates if the command has been executed without using the internal ECC. */
    CY_SD_HOST_WP_ERASE_SKIP_R1_RESP         = 15U, /**< It is set when only partial address space was erased due to existing write protected blocks or the temporary or permanent write protected card was erased. */
    CY_SD_HOST_CSD_OVERWRITE_R1_RESP         = 16U, /**< It indicates read only section of the CSD does not match the card content or there was an attempt to reverse the copy or permanent WP bits was made. */
    CY_SD_HOST_ERROR_R1_RESP                 = 19U, /**< A general or an unknown error occurred during the operation. */
    CY_SD_HOST_CC_ERROR_R1_RESP              = 20U, /**< Internal card controller error. */
    CY_SD_HOST_CARD_ECC_FAILED_R1_RESP       = 21U, /**< Card internal ECC was applied but failed to correct the data. */
    CY_SD_HOST_ILLEGAL_COMMAND_R1_RESP       = 22U, /**< Command  not  legal  for  the  card. */
    CY_SD_HOST_COM_CRC_ERROR_R1_RESP         = 23U, /**< The CRC check of the previous command failed. */
    CY_SD_HOST_LOCK_UNLOCK_FAILED_R1_RESP    = 24U, /**< Set when a sequence or password error has been detected in lock/unlock card command. */
    CY_SD_HOST_CARD_IS_LOCKED_R1_RESP        = 25U, /**< When set, signals that the card is locked by the host. */
    CY_SD_HOST_WP_VIOLATION_R1_RESP          = 26U, /**< Set when the host attempts to write to a protected block or to the temporary or permanent write protected card. */
    CY_SD_HOST_ERASE_PARAM_R1_RESP           = 27U, /**< An invalid selection of write-blocks for erase occurred. */
    CY_SD_HOST_ERASE_SEQ_ERROR_R1_RESP       = 28U, /**< An error in the sequence of erase commands occurred. */
    CY_SD_HOST_BLOCK_LEN_ERROR_R1_RESP       = 29U, /**< The transferred block length is not allowed for this card, or the number of transferred bytes does not match the block length. */
    CY_SD_HOST_ADDRESS_ERROR_R1_RESP         = 30U, /**< A misaligned address which did not match the block length was used in the command. */
    CY_SD_HOST_OUT_OF_RANGE_R1_RESP          = 31U, /**< The command's argument was out of the allowed range for this card. */
} cy_en_sd_host_r1_response_t;

/** \} group_sd_host_enums */

/**
* \addtogroup group_sd_host_data_structures
* \{
*/

